tap "argoproj/tap"
tap "candid82/brew"
tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "moncho/dry"
cask "xquartz"
# Graphical system information display for macOS
brew "archey"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Change macOS display brightness from the command-line
brew "brightness"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create and manage Android app repositories for F-Droid
brew "fdroidserver"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Build tool for Clojure
brew "leiningen"
# Asynchronous event library
brew "libev"
# Library to render SVG files using Cairo
brew "librsvg"
# GNOME XML library
brew "libxml2"
# XML security library
brew "libxmlsec1"
# Text-based web browser
brew "lynx"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# High-level interpreted language for numerical computing
brew "octave"
# OCaml package manager
brew "opam"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Optimizer for PNG files
brew "pngcrush"
# Tool for optimizing PNG images
brew "pngnq"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@11", restart_service: true
# Modern replacement for ps written by Rust
brew "procs"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# QR Code generation
brew "qrencode"
# State machine compiler
brew "ragel"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing", restart_service: true
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Small Clojure interpreter and linter
brew "candid82/brew/joker"
brew "d12frosted/emacs-plus/emacs-plus@27", link: false
# a Docker manager for the terminal
brew "moncho/dry/dry"
cask "alfred"
cask "brave-browser"
cask "dash"
cask "dozer"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "fork"
cask "godot"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "minikube"
cask "notion"
cask "openscad"
cask "telegram"
cask "tunnelblick"
cask "visual-studio-code"
cask "vnote"
