tap "argoproj/tap"
tap "candid82/brew"
tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
cask "xquartz"
# Graphical system information display for macOS
brew "archey"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Change macOS display brightness from the command-line
brew "brightness"
# Library for manipulating PNG images
brew "libpng"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Build tool for Clojure
brew "leiningen"
# Asynchronous event library
brew "libev"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Tools for one-time password authentication systems
brew "oath-toolkit"
# High-level interpreted language for numerical computing
brew "octave"
# The OCaml package manager
brew "opam"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Optimizer for PNG files
brew "pngcrush"
# Tool for optimizing PNG images
brew "pngnq"
# Object-relational database system
brew "postgresql", restart_service: true
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# State machine compiler
brew "ragel"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# High-performance, platform-neutral implementation of VNC
brew "tiger-vnc"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Get stuff done with container-native workflows for Kubernetes.
brew "argoproj/tap/argo"
# Small Clojure interpreter and linter
brew "candid82/brew/joker"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus"
cask "alfred"
cask "brave-browser"
cask "dash"
cask "dozer"
cask "fork"
cask "google-chrome"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "minikube"
cask "notion"
cask "telegram"
