accountsservice
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adwaita-icon-theme
alsa-firmware
alsa-plugins
alsa-utils
android-udev
arc-gtk-theme-eos
b43-fwcutter
base
base-devel
bash-completion
bat
bind
bluez
bluez-utils
btrfs-progs
cantarell-fonts
ccache
clang
cliphist
cmake
cryptsetup
dart-sass
device-mapper
dhclient
diff-so-fancy
diffutils
dmidecode
dmraid
dnsmasq
docker
docker-compose
dosfstools
downgrade
dracut
duf
dust
e2fsprogs
efibootmgr
efitools
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-theming
eog
eos-apps-info
eos-hooks
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-settings-gnome
eos-update-notifier
ethtool
evince
exfatprogs
eza
f2fs-tools
fd
ffmpegthumbnailer
file-roller
firefox
firewalld
fprintd
fsarchiver
gdm
git
github-cli
glances
go
gperf
haveged
hdparm
htop
hwdetect
hwinfo
inetutils
intel-media-driver
intel-ucode
interception-dual-function-keys
interception-tools
inxi
iptables-nft
iwd
jfsutils
jq
kdeconnect
kitty
less
logrotate
mage
mako
man-db
man-pages
mdadm
meld
mesa-utils
mlocate
modemmanager
mosh
mpv
mtools
nano
nano-syntax-highlighting
nautilus
nautilus-sendto
navi
neofetch
neovim
netctl
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
ninja
nodejs
noto-fonts
npm
nss-mdns
ntfs-3g
ntp
obsidian
openbsd-netcat
openscad
pacman-contrib
pavucontrol
perl
picom
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
polkit-kde-agent
poppler-glib
power-profiles-daemon
pv
python
python-capng
python-defusedxml
python-packaging
python-pip
qemu-base
rebuild-detector
reflector
reflector-simple
reiserfsprogs
ripgrep
rsync
rtkit
ruby
rust
rustscan
s-nail
sg3_utils
smartmontools
sof-firmware
sudo
superslicer
sushi
syncthing
sysfsutils
systemd-sysvcompat
telegram-desktop
texinfo
tldr
totem
tree
ttf-bitstream-vera
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-opensans
unrar
unzip
upower
usb_modeswitch
usbutils
vde2
vi
virt-manager
vivaldi
watchexec
weechat
welcome
wget
which
wireplumber
wl-clipboard
wofi
wpa_supplicant
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xf86-input-libinput
xf86-video-intel
xfsprogs
xl2tpd
xorg-server
xorg-server-xephyr
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xterm
yay
zeal
zoxide
zsh
